Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРезервирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРезервирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодулиИПодсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтолПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительныйПоиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительныйПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПоиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Столы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Стол</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Столы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостояниеЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗаказовПокупателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодулиИПодсистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРезервирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРезервирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийСтол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МодулиИПодсистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>МодулиИПодсистемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ресторан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПокупателя/Ext/ObjectModule.bsl
Процедура ПодготовитьШапку(РежимЗаписи, РежимПроведения)
	
	ТекущаяДата = ТекущаяДата();
	
	Распечатан = (Проведен Или (РежимЗаписи = РежимЗаписиДокумента.Проведение)) И (Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения);
	
	Состояние = УправлениеЗаказами.ПолучитьСостояниеДокумента(ЭтотОбъект, РежимЗаписи);
	
	Модуль = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
		Модуль,
		Перечисления.МодулиИПодсистемы.Ресторан);
		
	Ресторан = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
		Ресторан,
		Справочники.Рестораны.ОсновнойРесторан());
		
	КоличествоКлиентов = Макс(КоличествоКлиентов, 1);
	
	ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
		ДатаНачалаПериода,
		Мин(ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаОкончанияПериода, ТекущаяДата), ТекущаяДата));
	
	Если Распечатан Или ПометкаУдаления Тогда
		ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
			ДатаОкончанияПериода,
			Макс(ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(ДатаНачалаПериода, ТекущаяДата), ТекущаяДата));
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		ПричинаОтказа = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьШапку()

Процедура ПодготовитьТабличнуюЧастьСтолы(РежимЗаписи, РежимПроведения)
	
	Если Столы.Количество() Тогда
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Столы.Ссылка КАК Стол,
		                      |	Столы.Номер КАК Номер
		                      |ИЗ
		                      |	Справочник.Столы КАК Столы
		                      |ГДЕ
		                      |	Столы.Ссылка В(&Столы)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Номер");
		Запрос.УстановитьПараметр("Столы", Столы.ВыгрузитьКолонку("Стол"));
		Результат = Запрос.Выполнить().Выгрузить();
		
		Столы.Загрузить(Результат);
		Если Столы.Количество() Тогда
			Стол = Столы[0].Стол;
		Иначе
			Стол = Неопределено;
		КонецЕсли;
		
		СтолПредставление = Неопределено;
		Для Каждого СтрокаТаблицыРезультата Из Результат Цикл
			Если ПустаяСтрока(СтолПредставление) Тогда
				СтолПредставление = СтрокаТаблицыРезультата.Номер;
			Иначе
				СтолПредставление = СтолПредставление + ", " + СтрокаТаблицыРезультата.Номер;
			КонецЕсли;
		КонецЦикла;
	
	Иначе
		
		Если ЗначениеЗаполнено(Стол) Тогда
			Столы.Добавить().Стол = Стол;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стол) Тогда
			СтолПредставление = Стол.Номер;
		Иначе
			СтолПредставление = Неопределено;
		КонецЕсли;
	
    КонецЕсли;
	
	// Период резервирования.
	ДатаНачалаРезервирования = Дата;
	ДатаОкончанияРезервирования = ДатаНачалаРезервирования + Справочники.Столы.ПолучитьМаксимальноеВремяРезервированияСекунд(Столы.ВыгрузитьКолонку("Стол")) - 1;
	
КонецПроцедуры // ПодготовитьТабличнуюЧастьСтолы()


Процедура ДвиженияПоРегистрамСостояний(РежимПроведения, Отказ);

	Если Не Отказ Тогда
		
		НаборЗаписей = РегистрыСведений.СостояниеЗаказовПокупателей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Ссылка);
		
		Если Проведен Или ПометкаУдаления Тогда
		Иначе
			
			Если Столы.Количество() Тогда
				Для Каждого СтрокаТабличнойЧастиСтолы Из Столы Цикл
					
					Если НаборЗаписей.Количество() Тогда
						НаборЗаписей[НаборЗаписей.Количество() - 1].СледующийСтол = СтрокаТабличнойЧастиСтолы.Стол;
					КонецЕсли;
					
					Запись = НаборЗаписей.Добавить();
					
					ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект);
					Запись.Документ = Ссылка;
					Запись.Стол = СтрокаТабличнойЧастиСтолы.Стол;
					
				КонецЦикла;
			Иначе
				
				Запись = НаборЗаписей.Добавить();
				
				ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект);
				Запись.Документ = Ссылка;
				
			КонецЕсли;
		
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ИнформацияОбОшибке(), Отказ, ,, НаборЗаписей, ЭтотОбъект);
		КонецПопытки;
	
	КонецЕсли;
		
КонецПроцедуры // ДвиженияПоРегистрамСостояний()


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Ресторан.
	Ресторан = ПолучитьСвойство(ДанныеЗаполнения, "Ресторан", Справочники.Рестораны.ОсновнойРесторан());
	
	// Телефон.
	СтруктураТелефона = УправлениеКонтрагентамиКлиентСервер.ПолучитьПустуюСтруктуруТелефона();
	УправлениеКонтрагентамиКлиентСервер.РазложитьТелефонПоПолям(ПолучитьСвойство(ДанныеЗаполнения, "ТелефонПредставление"), СтруктураТелефона);
	ТелефонПоиск = СтруктураТелефона.Поиск;
	
	// Столы.
	Для Каждого Значение Из ПолучитьСвойство(ДанныеЗаполнения, "Столы", Новый СписокЗначений).ВыгрузитьЗначения() Цикл
		Столы.Добавить().Стол = Значение;
	КонецЦикла;	

	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Распечатан Тогда
		ПроверяемыеРеквизиты.Добавить("Стол");
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьШапку(РежимЗаписи, РежимПроведения);
	ПодготовитьТабличнуюЧастьСтолы(РежимЗаписи, РежимПроведения);
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоРегистрамСостояний(РежимПроведенияДокумента.Неоперативный, Отказ);

КонецПроцедуры // ПриЗаписи()
